# Parameters
nc: 3  # number of classes
depth_multiple: 0.33
width_multiple: 0.50

anchors:
  - [10, 13, 16, 30, 33, 23]   # P3/8
  - [30, 61, 62, 45, 59, 119]  # P4/16
  - [116, 90, 156, 198, 373, 326]  # P5/32

backbone:
  [
    [-1, 1, MobileNetV3Small, [True]],   # 0: backbone → [P3=40, P4=96, P5=576]
    [0, 1, Select, [0]],                 # 1: P3
    [0, 1, Select, [1]],                 # 2: P4
    [0, 1, Select, [2]],                 # 3: P5
    [3, 1, SPPF, [1024, 5]],             # 4: SPPF (in=576, out=1024, k=5)
  ]


head:
  [
    [4, 1, Conv, [512, 1, 1]],           # 5: dari 1024 -> 512
    [2, 1, Conv, [256, 1, 1]],           # 6: dari 96   -> 256
    [1, 1, Conv, [128, 1, 1]],           # 7: dari 40   -> 128

    [5, 1, nn.Upsample, [None, 2, 'nearest']],   # 8
    [[6, 8], 1, Concat, [1]],                    # 9
    [9, 3, C3, [256, False]],                    # 10

    [10, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
    [[7, 11], 1, Concat, [1]],                   # 12
    [12, 3, C3, [128, False]],                   # 13

    [13, 1, Conv, [256, 3, 2]],                  # 14
    [[14, 10], 1, Concat, [1]],                  # 15
    [15, 3, C3, [256, False]],                   # 16

    [16, 1, Conv, [512, 3, 2]],                  # 17
    [[17, 5], 1, Concat, [1]],                   # 18
    [18, 3, C3, [512, False]],                   # 19

    [[13, 16, 19], 1, Detect, [nc, anchors]],    # Detect
  ]