# Parameters
nc: 3  # number of classes
depth_multiple: 0.33
width_multiple: 0.50

anchors:
  - [10, 13, 16, 30, 33, 23]   # P3/8
  - [30, 61, 62, 45, 59, 119]  # P4/16
  - [116, 90, 156, 198, 373, 326]  # P5/32

backbone:
  [
    [-1, 1, MobileNetV3Small, [True]],    # 0
    [0, 1, Select, [0]],                  # 1
    [1, 1, CoordAtt, [24, 24]],           # 2
    [0, 1, Select, [1]],                  # 3
    [3, 1, CoordAtt, [40, 40]],           # 4
    [0, 1, Select, [2]],                  # 5
    [5, 1, CoordAtt, [576, 576]],         # 6
    [6, 1, SPPF, [1024, 5]],              # 7
  ]


head:
  [
    [7, 1, Conv, [512, 1, 1]],           # 8
    [4, 1, Conv, [256, 1, 1]],           # 9
    [2, 1, Conv, [128, 1, 1]],            # 10

    [8, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
    [[9, 11], 1, Concat, [1]],                 # 12
    [12, 3, C3, [256, False]],                 # 13

    [13, 1, nn.Upsample, [None, 2, 'nearest']], # 14
    [[10, 14], 1, Concat, [1]],                # 15
    [15, 3, C3, [128, False]],                  # 16

    [16, 1, Conv, [256, 3, 2]],                # 17
    [[17, 13], 1, Concat, [1]],                # 18
    [18, 3, C3, [256, False]],                 # 19

    [19, 1, Conv, [512, 3, 2]],                # 20
    [[20, 8], 1, Concat, [1]],                 # 21
    [21, 3, C3, [512, False]],                 # 22

    [[16, 19, 22], 1, Detect, [nc, anchors]],  # Detect
  ]